Repository: OmegaT-L10N/es
Catalog: tm/Gnome localization/en-es.tmx
Source language: en
Languages: es

source: After opening the Preferences Dialog, you will find a list of all available plugins, with corresponding checkboxes, under the "Plugins" tab. To enable or disable a plugin, toggle its checkbox. Only active plugins can be accessed via Accerciser's interface.
es: Después de abrir el diálogo de preferencias, encontrará una lista de complementos disponibles, con sus correspondientes casillas, en la pestaña «Complementos». Para activar o desactivar un complemento, conmute su casilla. Sólo se puede acceder a los complementos activos a través de la interfaz de Accerciser.

source: Right-clicking on any given plugin allows you to choose its location: "Top Panel", "Bottom Panel", and "New View". Selecting "New View" creates a new window for the plugin.
es: Una pulsación con el botón derecho sobre un complemento dado le permite elegir su ubicación: «Panel superior», «Panel inferior» y «Nueva vista». Al seleccionar «Nueva vista» se crea una ventana nueva para el complemento.

source: Configuring plugins' preferences
es: Configurar las preferencias de los complementos

source: Accerciser allows you to adjust your plugins' preferences.
es: Accerciser le permite ajustar las preferencias de sus complementos.

source: You may bypass the Preferences dialog by using drag and drop to move a plugin from a location to another.
es: Puede omitir el diálogo de preferencias usando arrastrar y soltar para mover un complemento desde una ubicación hasta otra.

source: Configuring global hotkeys
es: Configurar teclas rápidas globales

source: Some elements in Accerciser may enable certain functionalities via hotkeys. An example is the Quick Select Plugin. The hotkey combination for each functionality can be changed via the Preferences dialog, under the "Global Hotkeys" tab. Under this tab, you will find a list of all features for which hotkeys can be configured. Use the ctrl, alt, and shift checkboxes to enable or disable these modifiers.
es: Algunos elementos en Accerciser puede activar ciertas funcionalidades mediante teclas rápidas. Un ejemplo es el complemento de selección rápida. La combinación de teclas rápidas para cada funcionalidad se puede cambiar en el diálogo de preferencias, en la pestaña «Teclas rápidas globales». En esta pestaña encontrará una lista de todas las características para las que se pueden configurar las teclas rápidas. Use las casillas Ctrl, Alt, y Mayús para activar o desactivar estos modificadores.

source: Configuring global hotkeys' preferences
es: Configurarlas preferencias de las teclas rápidas globales

source: Accerciser allows you to adjust your hotkeys' preferences.
es: Accerciser le permite ajustar las preferencias de sus teclas rápidas.

source: Accerciser allows you to adjust your plugin's preferences.
es: Accerciser le permite ajustar las preferencias de sus complementos.

source: Configuring widget's highlighting
es: Configurar el resaltado de widgets

source: Some of Accerciser's elements, such as the global hotkey ctrl+alt+/, highlight a specific widget in a target application. The highlighting duration, border color, and fill color can be customized via the Preferences dialog, under the "Highlighting" tab.
es: Algunos elementos de Accerciser, como la tecla rápida global ctrl+alt+/, resaltan un widget específico en la aplicación objetivo. La duración del resaltado, el color del borde y el color de relleno se pueden personalizar en el diálogo de preferencias, en la pestaña «Resaltado».

source: Configuring highlighting preferences
es: Configurar las preferencias de resaltado

source: Accerciser allows you to adjust your highlighting preferences.
es: Accerciser le permite ajustar sus preferencias de resaltado.sort

source: 5. Quick Select Plugin
es: 5. Complemento de selección rápida

source: Locating the object you need
es: Ubicando el objeto que necesita

source: Quick Select Plugin
es: Complemento de selección rápida

source: The Quick Select Plugin does not provide a visible interface like the other default Accerciser plugins - instead, it adds facilities for quickly selecting items in the Application Tree View via global hotkeys. Originally, these hotkeys were part of Accerciser's core code, turning into the Quick Select Plugin later.
es: El complemento de selección rápida no proporciona una interfaz visible coma la de los otros complementos de Accerciser; en su lugar, añade características para seleccionar elementos rápidamente en la vista en árbol de la aplicación mediante teclas rápidas globales. Originalmente, estas teclas rápidas formaban parte del núcleo del código de Accerciser, pero posteriormente se pasaron al complemento de selección rápida.

source: The Quick Select Plugin provides two global hotkeys. Pressing ctrl+alt+a selects the last focused accessible widget in the Application Tree View. Pressing ctrl+alt+/ selects the accessible widget under the pointer in the Application Tree View and highlights it in the target application.
es: El complemento de selección rápida proporciona dos teclas rápidas globales. Pulsar Ctrl+Alt+a selecciona el último widget accesible con el foco en la vista en árbol de la aplicación. Pulsar Ctrl+alt+/ seleccione el widget accesible debajo del puntero en la vista en árbol de la aplicación y lo resalta en la aplicación objetivo._

source: external ref='figures/validator_report.png' md5='a21bc11a8fc1f8d7976d7ea8a3dc80d2'
es: external ref='figures/validator_report.png' md5='a21bc11a8fc1f8d7976d7ea8a3dc80d2'sort

source: 3. Validator Default Plugin
es: 3. Complemento validador predeterminado

source: Testing an application for accessibility
es: Comprobar la accesibilidad de una aplicación

source: AT-SPI Validator Plugin
es: Complemento de validación AT-SPI

source: The AT-SPI Validator Plugin generates a report with accessibility issues related to a target application. For each error, the report includes the severity level and a brief description.
es: El complemento de validación AT-SPI genera un informe con los errores de accesibilidad de una aplicación objetivo. El informe incluye el nivel de gravedad y una breve descripción para cada error.

source: The AT-SPI Validator Plugin generates useful reports for verifying the accessibility of a target application.
es: El complemento de validación AT-SPI genera informes útiles para verificar la accesibilidad de una aplicación objetivo.

source: Running the AT-SPI Validator Plugin
es: Ejecutar el complemento de validación AT-SPI

source: To run the AT-SPI Validator Plugin, select an item in the Application Tree View. The validator will generate the report with respect to the selected item and all of its descendant widgets in the tree hierarchy.
es: Para ejecutar el complemento de validación AT-SPI seleccione un elemento en la vista en árbol de la aplicación. El validador generará el informe correspondiente al elemento seleccionado y de todos sus widgets hijos en la jerarquía del árbol.

source: After selecting an item, choose a validation schema in the combobox and press the Validate button to start generating the report. If you want to cancel the execution, just press the Validate button again.
es: Después de seleccionar un elemento, elija un esquema de validación en la caja combinada y pulse el botón Validar para empezar a generar el informe. Si quiere cancelar la ejecución, simplemente pulse el botón Validar otra vez.

source: The generated report is interactive. Therefore, you can double-click any error found to check which of the target application widgets is causing it. The corresponding widget will then appear selected in the Application Tree View and highlighted in the target application.
es: El informe generado es interactivo. Por lo tanto, puede hacer una doble pulsación en cualquier error encontrado para comprobar qué aplicación objetivo lo está causando. El widget correspondiente aparecerá seleccionado en la vista en árbol de la aplicación y resaltado en la aplicación objetivo.

source: If you want to save the generated report in your system, just click the Save button. To clear the validation screen, press the Clear button.
es: Si quiere guardar en informe generado en su equipo, simplemente pulse el botón Guardar. Para limpiar la pantalla de validación, pulse el botón Limpiar.

source: To get more information about an error in the generated report, make sure the corresponding item is selected and press the Help button. It will open a Help Page in your default browser.
es: Para obtener más información sobre un error en el informe generado, asegúrese de que el elemento correspondiente está seleccionado y pulse el botón Ayuda. Se abrirá una página de ayuda en su explorador predeterminado.

source: 's logo
es: Logo de

source: Give your application an accessibility workout
es: Dé a su aplicación una capacidad para ser accesible

source: Accerciser Accessibility Explorer
es: Explorador de accesibilidad Accerciser

source: A list of plugins that are disabled by default
es: Lista de complementos desactivados de forma predeterminada

source: A list of plugins that are disabled by default.
es: Lista de complementos desactivados de forma predeterminada.

source: Highlight duration
es: Resaltar la duración

source: The duration of the highlight box when selecting accessible nodes.
es: La duración de la caja resaltada al seleccionar nodos accesibles.

source: Highlight fill color
es: Resaltar el color de relleno

source: The color and opacity of the highlight fill.
es: El color y la opacidad del resaltado del relleno.

source: Highlight border color
es: Resaltar el color del borde

source: The color and opacity of the highlight border.
es: El color y la opacidad del resaltado del borde.

source: Horizontal split
es: División horizontal

source: Position of the horizontal split of the main window.
es: Posición de la división horizontal de la ventana principal.

source: Vertical split
es: División vertical

source: Position of the vertical split of the main window.
es: Posición de la división vertical de la ventana principal.

source: Default window height
es: Altura predeterminada de ventana

source: The window height value.
es: El valor de la altura de la ventana.

source: Default window width
es: Anchura predeterminada de ventana

source: The window width value.
es: El valor de la anchura de la ventana.

source: The layout for the bottom panel
es: La distribución para el panel inferior

source: The layout for the bottom panel pluginview.
es: La distribución para la vista del complemento del panel inferior.

source: The layout for the top panel
es: La distribución para el panel superior

source: The layout for the top panel pluginview.
es: La distribución para la vista del complemento del panel superior.

source: Single layout view
es: Vista de distribución única

source: View plugins in a single layout.
es: Ver complementos en una distribución única.

source: Available new pluginviews
es: Vistas de complemento nuevas disponibles

source: This list contains all the new available pluginviews
es: Esta lista contiene todas las vistas de complementos nuevas disponibles

source: The pluginview layout
es: La distribución de la vista del complemento

source: The default plugin layout for the top panel.
es: Distribución predeterminada del complemento para el panel superior.

source: Window height
es: Altura de la ventana

source: Window height value.
es: Valor de la altura de la ventana.

source: Window width
es: Anchura de la ventana

source: Window width value.
es: Valor de la anchura de la ventana.

source: Hotkey combination
es: Combinación de teclas

source: Hotkey combination for related action.
es: Acción relacionada con la combinación de teclas.

source: API Browser
es: Examinador API

source: Browse the various methods of the current accessible
es: Examinar los métodos varios del accesible actual

source: Hide private attributes
es: Ocultar los atributos privados

source: Method
es: Método

source: Property
es: Propiedad

source: Value
es: Valor

source: IPython Console
es: Consola IPython

source: Interactive console for manipulating currently selected accessible
es: Consola interactiva para manipular el accesible actualmente seleccionado

source: Event monitor
es: Monitor de eventos

source: C_lear Selection
es: _Limpiar la selección

source: Everything
es: Todo

source: Selected application
es: Aplicación seleccionada

source: Selected accessible
es: Accesible seleccionado

source: Source
es: Fuente

source: Event Monitor
es: Monitor de eventos

source: Shows events as they occur from selected types and sources
es: Muestra los eventos tal y como ocurren desde los tipos y fuentes seleccionados

source: Highlight last event entry
es: Resaltar la última entrada de evento

source: Start/stop event recording
es: Iniciar/parar el registro de eventos

source: Clear event log
es: Limpiar el registro de eventos

source: Child count
es: Conteo de hijos

source: (no description)
es: (sin descripción)

source: States
es: Estados

source: Show
es: Mostrar

source: Relations
es: Relaciones

source: Attributes
es: Atributos

source: _Accessible
es: _Accesible

source: Perform action
es: Realizar acción

source: Acti_on
es: A_cción

source: Version
es: Versión

source: Ap_plication
es: A_plicación

source: Col_lection
es: Co_lección

source: Relative position
es: Posición relativa

source: Size
es: Tamaño

source: Layer
es: Capa

source: MDI-Z-order
es: MDI-Z-orden

source: Alpha
es: Alfa

source: Absolute position
es: Posición absoluta

source: Co_mponent
es: Co_mponente

source: Des_ktop
es: _Escritorio

source: Locale:
es: Localización:

source: _Document
es: _Documento

source: Hyperlink
es: Hiperenelace

source: H_ypertext
es: H_ipertexto

source: Position
es: Posición

source: Locale
es: Región

source: _Image
es: _Imagen

source: Lo_gin Helper
es: Ayudante de _inicio de sesión

source: _Selection
es: _Selección

source: St_reamable Content
es: Contenido _reproducible

source: Caption:
es: Descripción:

source: Summary:
es: Resumen:

source: Selected columns
es: Columnas seleccionadas

source: Selected rows
es: Filas seleccionadas

source: Columns
es: Columnas

source: Rows
es: Filas

source: Table Information
es: Información de la tabla

source: name (x,y)
es: nombre (x,y)

source: Header:
es: Cabecera:

source: Extents:
es: Amplitud:

source: Row
es: Fila

source: Column
es: Columna

source: Selected Cell
es: Celda seleccionada

source: _Table
es: _Tabla

source: Text
es: Texto

source: Offset
es: Desplazamiento

source: Include defaults
es: Incluir predeterminados

source: Start: 0
es: Final: 0

source: End: 0
es: Inicio: 0

source: Te_xt
es: Te_xto

source: Current value
es: Valor actual

source: Minimum increment
es: Mínimo incremento

source: Maximum value
es: Valor máximo

source: Minimum value
es: Valor mínimo

source: Val_ue
es: Val_or

source: unknown
es: desconocido

source: Interface Viewer
es: Visor de interfaces

source: Allows viewing of various interface properties
es: Permite ver varias propiedades del interfaz

source: (not implemented)
es: (no implementado)

source: Name
es: Nombre

source: V_alidate
es: V_alidar

source: Idle
es: Inactivo

source: No description
es: Sin descripción

source: AT-SPI Validator
es: Validador AT-SPI

source: Validates application accessibility
es: Valida la accesibilidad de una aplicación

source: Level
es: Nivel

source: Role
es: Rol

source: Saving
es: Guardado

source: Validating
es: Validando

source: EXCEPT
es: EXCEPTO

source: WARN
es: ADVERTENCIA

source: DEBUG
es: DEPURAR

source: Basic
es: Básico

source: Tests fundamental GUI application accessibility
es: Comprueba la accesibilidad fundamental del IGU de una aplicación

source: actionable %s is not focusable or selectable
es: el accionable %s no puede tener el foco o ser seleccionado

source: interactive %s is not actionable
es: el interactivo %s no es accionable

source: more than one focused widget
es: hay más de un widget con el foco

source: %s has no text interface
es: la interfaz de %s no tiene texto

source: %s index in parent does not match child index
es: El índice en el padre no coincide con el índice del hijo en %s

source: Missing reciprocal for %s relation
es: Falta el recíproco para la relación %s

source: %s missing name or label
es: falta el nombre o la etiqueta de %s

source: focusable %s has a table interface, but not a selection interface
es: el objeto %s que puede tener el foco tiene una interfaz de tabla, pero no una interfaz de selecciónbutton has focused state without focusable state

source: %s has %s state without %s state
es: %s tiene un estado %s sin tener %s

source: %s does not belong to a set
es: %s no pertenece al conjunto

source: %(rolename)s index %(num)d does not match row and column
es: El índice %(num)d del elemento %(rolename)s no coincide con la fila y columnaparent indexrow and column index

source: %(rolename)s parent index %(num1)d does not match row and column index %(num2)d
es: El índice padre %(num1)d del elemento %(rolename)s no coincide con la fila y columna del índice %(num2)d

source: %s has no name or description
es: %s no tiene nombre o descripción

source: _Preferences...
es: Prefere_ncias...

source: _Contents
es: _Contenido

source: Accerciser could not see the applications on your desktop. You must enable desktop accessibility to fix this problem. Do you want to enable it now?
es: Accerciser no puede ver las aplicaciones en su escritorio. Debe activar la accesibilidad del escritorio para arreglar este problema. ¿Quiere activarla ahora?

source: Note: Changes only take effect after logout.
es: Nota: Los cambios tienen efecto después de salir de la sesión.

source: <dead>
es: <muerto>

source: Children
es: Hijos

source: _Refresh Registry
es: Ac_tualizar registro

source: Refresh all
es: Actualizar todo

source: Refresh _Node
es: Actualizar _nodo

source: Refresh selected node's children
es: Actualizar los hijos del nodo seleccionado

source: Component
es: Componente

source: Task
es: Tarea

source: Key
es: Tecla

source: Ctrl
es: Control

source: Shift
es: Mayús

source: Top panel
es: Panel superior

source: Bottom panel
es: Panel inferior

source: accerciser Preferences
es: Preferencias de accerciser

source: Plugins
es: Complementos

source: Global Hotkeys
es: Teclas rápidas globales

source: Highlighting
es: Resaltado

source: Highlight duration:
es: Duración del resaltado:

source: Border color:
es: Color del borde:

source: The border color of the highlight box
es: El color del borde de la caja resaltada

source: Fill color:
es: Color de relleno:

source: The fill color of the highlight box
es: El color de relleno de la caja resaltada

source: An interactive Python accessibility explorer
es: Un examinador de accesibilidad de Python interactivo

source: The New BSD License See the COPYING and NOTICE files for details.
es: La nueva licencia BSD, vea los archivos COPYING y NOTICE para más detalles.

source: Web site
es: Página web

source: _Add Bookmark...
es: _Añadir marcador...

source: Bookmark selected accessible.
es: Marcar el accesible actualmente seleccionado.

source: _Edit Bookmarks...
es: _Editar los marcadores...

source: Manage bookmarks.
es: Administrar marcadores.

source: Edit Bookmarks...
es: Editar los marcadores...

source: Title
es: Título

source: Application
es: Aplicación

source: Path
es: Ruta

source: Add Bookmark...
es: Añadir marcador...

source: Title:
es: Título:

source: Application:
es: Aplicación:

source: Path:
es: Ruta:

source: Plugin Errors
es: Errores del complementoviewport

source: View
es: Ver

source: No view
es: Sin vista

source: _Single plugins view
es: Vista _individual de complementos

source: Plugin View
es: Vista del complemento

source: Plugin View (%d)
es: Vista del complemento (%d)

source: _New view...
es: _Nueva vista...

source: New View...
es: Nueva vista...

source: _File
es: _Archivo

source: _Edit
es: _Editarmenu

source: _Bookmarks
es: _Marcadoresmenu

source: Creative Commons Share Alike 3.0
es: Creative Commons Compartir Igual 3.0

source: To configure plugins, hotkeys, and highlighting, do either ctrl+p or EditPreferences to open a dialog.
es: Para configurar los complementos, las teclas rápidas y el resaltado, pulse ctrl+p o EditarPreferencias para abrir un diálogo.

source: 2. IPython Plugin
es: 2. Complemento IPython

source: When all else fails
es: Cuando todo falla

source: IPython Console Plugin
es: Complemento de la Consola IPython

source: The IPython Console Plugin allows real-time interaction with a selected item in the Application Tree View. Since the IPython Console Plugin is an interactive Python shell, you can import any Python modules you want.
es: El complemento de la Consola IPython permite interacción en tiempo real con el elemento seleccionado en la vista en árbol de la aplicación. Ya que el complemento de la Consola IPython es una shell Python interactiva, puede importar cualquier módulo Python que quiera.

source: Make sure you have the standalone package IPython installed in your system. Otherwise, the IPython Console Plugin will not work properly.
es: Asegúrese de que tiene el paquete autónomo de IPython instalado en su sistema. De otra forma, el complemento de la Consola IPython no funcionará correctamente.

source: Running the IPython Console Plugin
es: Ejecutar el complemento de la consola IPython

source: To run the IPython Console Plugin, select one of the accessible items listed in the Application Tree View - either an application or a widget. In the plugin, the selected item will correspond to the variable 'acc'.
es: Para ejecutar el complemento de la Consola IPython, seleccione uno de los elementos accesibles listados en la vista en árbol de la aplicación; ya sea una aplicación o un widget. En el complemento, el elemento seleccionado corresponderá a la variable «acc».

source: Pressing Tab shows completions for the current command in the console, what can be useful for discovering pyatspi methods.
es: Pulsar Tab muestra sugerencias para completar el comando actual en la consola, lo que puede ser útil para descubrir métodos pyatspi.

source: 1. What is Accerciser?
es: 1. ¿Qué es Accerciser?

source: An interactive accessibility explorer
es: Un explorador de accesibilidad interactivo

source: What is Accerciser?
es: ¿Qué es Accerciser?

source: Accerciser is an interactive Python accessibility explorer. It uses the AT-SPI library to inspect, examine, and interact with widgets, allowing you to check if an application is providing correct information to assistive technologies and automated testing frameworks. Accerciser comes with a set of plugins that you can use to create custom views of accessibility information.
es: Accerciser es un explorador de accesibilidad interactivo escrito en Python. Usa la biblioteca AT-SPI para inspeccionar, examinar e interaccionar con los widgets, permitiéndole comprobar si una aplicación proporciona la información correcta a las tecnologías de asistencia y entornos de trabajo de prueba automáticos. Accerciser incluye un conjunto complementos que puede usar para crear vistas personalizadas de la información de accesibilidad.
